import openpyxl
my_dict = {'48': 'Вісікіренко Максим Тахірович', '49': 'Власов Дмитро Вадимович', '50': 'Гангільдієва Софія Максаківна', '51': 'Герасименко Олег Віталійович', '52': 'Герасімчук Домініка Андріївна', '53': 'Гинник Мілана Василівна', '54': 'Година Артур Олексійович', '55': 'Голомаз Євгенія Миколаївна', '56': 'Горлач Владислав Сергійович', '57': 'Горонович Єлизавета Вікторівна', '58': 'Гринченко Денис Ярославович', '59': 'Гук Валерія Сергіївна', '60': 'Давиденко Богдан Володимирович', '61': 'Данильченко Софія Русланівна', '62': 'Даниш Давид Євгенійович', '63': 'Дашко Марк Валерійович', '64': 'Дичук Давид Вадимович', '65': 'Долінце Нікіта Олександрович', '66': 'Донець Марк Миколайович', '67': 'Дусь Мирон Вадимович', '68': 'Єфіменко Матвій Романович', '69': 'Жуковець Нікіта Олександрович', '70': 'Журавльов Захар Микитович', '71': 'Зарва Матвій Русланович', '72': 'Заяц Мілана Олександрівна', '73': 'Зінчук Діана Максимівна', '74': 'Іваненко Михаїл Ярославович'}


book = openpyxl.Workbook()
sheet = book.active
row = 1
for i in my_dict.items():
    sheet.cell(row=row, column=1).value = i[0]
    sheet.cell(row=row, column=2).value = i[1]
    row += 1
book.save('my_book.xlsx')
book.close()